app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('ca1979c20699aed763b1d82d19902b8bc35388b1', '2009-01-06 16:14:38', '7ebf5df490280da6165778c27f78a5aa15213df4', NULL, NULL, 'amintz', 'aaron.mintz@gmail.com', '2009-01-06 16:14:38')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save